//1
res = 'number' + 3 + 3
console.log (res); //number33   - Відбувається конкатенація зліва направо, якщо перший рядок стрінга, всі наступні рядки перетворюються на стрінгу

//2
res = 5 && "qwerty"
console.log (res); //qwerty    - Оператор && повертає перше хибне значення або останнє правдиве, якщо всі операнди є правдивими

//3
res = +'40' + +'2' + "hillel"
console.log (res); //42hillel  - Оператор "+" перед рядком перетворив рядок на число, таким чином отримали число 42, "+" коли один з операндів — рядок, перетворив інший операнд на рядок і виконав конкатенацію, отримали 42hillel

//4
res = '10' - 5 === 6
console.log (res);// false   - Оператор "-" перетворив рядок на число, 10-5 = 5; оператор "===" порівняв 5 і 6, отримали false

//5
res = true + false
console.log (res); //1    - true перетворюється на 1, false перетворюється на 0.

//6
res = '4px' - 3
console.log (res); //NaN   - оператор "-" намагається перетворити 4px на число, у результаті перетворює на NaN

//7
res = '4' - 3
console.log (res); //1   - оператор "-" перетворив стрінгу на цифру

//8
res = '6' + 3 ** 0;
console.log (res);//61  - Будь-яке число, піднесене до нульової степені, дорівнює 1.Оператор + , коли один з операндів є рядком, перетворює інший операнд на рядок і виконує конкатенацію.

//9
res = 12 / '6'
console.log (res); //2    - оператор ділення намагається перетворити операнди на числа

//10
res = '10' + (5 === 6);
console.log (res);// 10false     -5===6 - буде false, логічне значення false перетворюється на рядок 'false', результатом конкатенації з '10' буде рядок '10false'.

//11
res = null == ''
console.log (res);//false   -null не дорівнює порожньому рядку

//12
res = 3 ** (9 / 3);
console.log (res); // 27     -3 * 3 * 3 = 27

//13
res = !!'false' == !!'true'
console.log (res);// true    -!!'false' — це true, !!'true' - це теж true

//14
res = 0 || '0' && 1
console.log (res); // 1     - Оператор && повертає перше хибне значення або останнє істинне значення ("0"-істинне, 1 - істинне),Оператор || повертає перше істинне значення (0 - хибне, 1 - істинне)

//15
res = (+null == false) < 1;
console.log (res);//false     -+null перетворює null на число 0, отримали (0 == false) < 1; (0 == false) false - це 0, тому буде true, (true < 1) true це 1, тому 1<1

//16
res = false && true || true
console.log (res);//true     -Оператор && повертає перше хибне значення або останнє істинне значення false; (false || true): Оператор || повертає перше істинне значення

//17
res = false && (false || true);
console.log (res);//false      -Оператор || повертає перше істинне значення, результатом буде true;Оператор && повертає перше хибне значення або останнє істинне значення.першим операндом є false, результатом виразу буде false

//18
res = (+null == false) < 1 ** 5;
console.log (res);// false    -+null перетворює null на число 0.(0 == false) - це true. 1 піднесене до будь-якого степеня завжди дорівнює 1. 1<1 - це false